---
kind: other
id: Properties.T:Autodesk.Revit.DB.RevolvedSurface
source: html/fdd3e6da-183e-0ecd-7094-4d95167eb735.htm
---
# RevolvedSurface Properties

Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface.